





Internet Engineering Task Force                            S. Hollenbeck
Internet-Draft                                            VeriSign, Inc.
November 10, 2000                                  Expires: May 10, 2001

            Extensible Provisioning Protocol Contact Mapping
                 <draft-hollenbeck-epp-contact-00.txt>

Status of this Memo

  This document is an Internet-Draft and is in full conformance with all
  provisions of Section 10 of RFC2026.

  Internet-Drafts are working documents of the Internet Engineering Task
  Force (IETF), its areas, and its working groups.  Note that other
  groups may also distribute working documents as Internet-Drafts.

  Internet-Drafts are draft documents valid for a maximum of six months
  and may be updated, replaced, or obsoleted by other documents at any
  time.  It is inappropriate to use Internet-Drafts as reference
  material or to cite them other than as "work in progress".

  The list of current Internet-Drafts can be accessed at
  http://www.ietf.org/ietf/1id-abstracts.txt

  The list of Internet-Draft Shadow Directories can be accessed at
  http://www.ietf.org/shadow.html.

Abstract

  This document describes an Extensible Provisioning Protocol (EPP)
  mapping for the provisioning and management of identifiers
  representing individuals or organizations (known as "contacts") stored
  in a shared central repository. Specified in XML, the mapping defines
  EPP command syntax and semantics as applied to contacts.

Conventions Used In This Document

  The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
  "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
  document are to be interpreted as described in [RFC2119].

  In examples, "C:" represents lines sent by a protocol client and "S:"
  represents lines returned by a protocol server.  Indentation in
  examples is provided only to illustrate element relationships and is
  not a REQUIRED feature of this protocol.

  XML protocol elements are case sensitive.




Hollenbeck                Expires May 10, 2001                  [Page 1]

Internet-Draft            EPP Contact Mapping          November 10, 2000


Table of Contents

  1. Introduction .................................................    3
  2. Object Attributes ............................................    4
  2.1 Contact and Client Identifiers ..............................    4
  2.2 Individual and Organizational Names .........................    4
  2.3 Address .....................................................    4
  2.3.1 Street, City, and State or Province .......................    4
  2.3.2 Postal Code ...............................................    4
  2.3.3 Country ...................................................    5
  2.4 Telephone Numbers ...........................................    5
  2.5 E-Mail Addresses ............................................    5
  2.6 Dates and Times .............................................    5
  2.7 Authorization Identifiers ...................................    5
  3. EPP Command Mapping ..........................................    6
  3.1 EPP Query Commands ..........................................    6
  3.1.1 EPP <info> Command ........................................    6
  3.1.2 EPP <ping> Command ........................................   10
  3.1.3 EPP <transfer> Command ....................................   11
  3.2 EPP Transform Commands ......................................   13
  3.2.1 EPP <create> Command ......................................   14
  3.2.2 EPP <delete> Command ......................................   16
  3.2.3 EPP <renew> Command .......................................   17
  3.2.4 EPP <transfer> Command ....................................   18
  3.2.5 EPP <update> Command ......................................   20
  4. Formal Syntax ................................................   23
  5. Internationalization Considerations ..........................   29
  6. IANA Considerations ..........................................   29
  7. Security Considerations ......................................   29
  8. References ...................................................   30
  9. Author's Address .............................................   31
  10. Full Copyright Statement ....................................   32



















Hollenbeck                Expires May 10, 2001                  [Page 2]

Internet-Draft            EPP Contact Mapping          November 10, 2000


1. Introduction

  This document describes a person and organization identifier mapping
  for version 1.0 of the Extensible Provisioning Protocol (EPP).  This
  mapping is specified using the Extensible Markup Language (XML) 1.0 as
  described in [XML] and XML Schema notation as described in [XML-SD]
  and [XML-SS].

  The referenced XML Schema documents recently progressed from Working
  Draft status to Candidate Recommendation status.  The references to
  these documents and the URIs used to refer to XML Schema namespaces
  MUST be changed once XML parsers that support the updated
  specifications are available.

  [EPP] provides a complete description of EPP command and response
  structures.  A thorough understanding of the base protocol
  specification is necessary to understand the mapping described in this
  document.

  It is important to note that XML is case sensitive.  XML
  specifications and examples provided in this document MUST be
  interpreted in the exact character case presented to develop a
  conforming implementation.

  This document is being discussed on the "rrp" mailing list.  To join
  the list, send a message to <majordomo@NSIRegistry.net> with the words
  "subscribe rrp" in the body of the message.  There is a web site for
  the list archives at <http://www.NSIRegistry.net/maillist/rrp>.























Hollenbeck                Expires May 10, 2001                  [Page 3]

Internet-Draft            EPP Contact Mapping          November 10, 2000


2. Object Attributes

  An EPP contact object has attributes and associated values that may be
  viewed and modified by the sponsoring client or the server.  This
  section describes each attribute type in detail.  The formal syntax
  for the attribute values described here can be found in the "Formal
  Syntax" section of this document.

2.1 Contact and Client Identifiers

  All EPP clients and contacts are identified by a server-unique
  identifier.  Client and contact identifiers are character strings with
  a specified minimum length, a specified maximum length, and a
  specified set of characters from which these identifiers can be
  formed.  The syntax used to represent both client and contact
  identifiers MUST be consistent; the contact identifier format
  specified in this document is consistent with the client identifier
  format specified in [EPP].

  An EPP server MUST support contact objects to provide management
  facilities for client identifiers.  Servers that provide only this
  level of support, and not support for client creation of contact
  objects, MUST NOT advertise contact object support in the EPP greeting
  and session creation process.

2.2 Individual and Organizational Names

  Individual and organizational names associated with a contact are
  represented using character strings.  These strings have a specified
  minimum length and a specified maximum length.

2.3 Address

  Every contact has associated postal address information.  A postal
  address contains street information, city information, OPTIONAL
  state/province information, a postal code, and a country identifier.

2.3.1 Street, City, and State or Province

  Contact street, city, and state or province information is represented
  using character strings.  These strings have a specified minimum
  length and a specified maximum length.

2.3.2 Postal Code

  Contact postal codes are represented using character strings.  These
  strings have a specified minimum length and a specified maximum
  length.



Hollenbeck                Expires May 10, 2001                  [Page 4]

Internet-Draft            EPP Contact Mapping          November 10, 2000


2.3.3 Country

  Contact country identifiers are represented using two-character
  identifiers specified in [ISO3166].

2.4 Telephone Numbers

  Contact telephone number structure requirements are defined in
  [E164a].  Telephone numbers described in this mapping are character
  strings that MUST begin with a plus sign ("+", ASCII value 0x002B),
  followed by a country code defined in [E164b], followed by a dot (".",
  ASCII value 0x002E), followed by a sequence of digits representing the
  telephone number.

2.5 E-Mail Addresses

  E-mail address syntax is defined in [RFC822].  This mapping does not
  prescribe minimum or maximum lengths for character strings used to
  represent e-mail addresses.

2.6 Dates and Times

  Date and time attribute values MUST be represented in Universal
  Coordinated Time (UTC). Both extended and truncated date and time
  forms defined in [ISO8601] MAY be used.

2.7 Authorization Identifiers

  Authorization identifiers are associated with contact objects to
  facilitate authorization of transfer requests.  Authorization
  identifiers use the transaction identifier syntax described in [EPP].




















Hollenbeck                Expires May 10, 2001                  [Page 5]

Internet-Draft            EPP Contact Mapping          November 10, 2000


3. EPP Command Mapping

  A detailed description of the EPP syntax and semantics can be found in
  [EPP].  The command mappings described here are specifically for use
  in provisioning and managing contact objects via EPP.

3.1 EPP Query Commands

  EPP provides three commands to retrieve contact information: <info> to
  retrieve detailed information associated with a contact, <ping> to
  determine if a contact is known to the server, and <transfer> to
  retrieve contact transfer status information.

3.1.1 EPP <info> Command

  The EPP <info> command is used to retrieve information associated with
  a contact.  In addition to the standard EPP command elements, the
  <info> command MUST contain a <contact:info> element that identifies
  the contact namespace and the location of the contact schema.  The
  <contact:info> element MUST contain the following child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the queried contact.

  Example <info> command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <info>
  C:      <contact:info xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:      </contact:info>
  C:    </info>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ClientX</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When an <info> command has been processed successfully, the EPP
  <response-data> element MUST contain a child <contact:info-data>
  element that identifies the contact namespace and the location of the



Hollenbeck                Expires May 10, 2001                  [Page 6]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  contact schema.  The <contact:info-data> element SHALL contain the
  following child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the queried contact.

  - A <contact:client-id> element that contains the identifier of the
  sponsoring client.  The sponsoring client is the client that has
  administrative privileges to manage the object.

  - A <contact:name> element that contains the name of the individual or
  role represented by the contact.  Each element MUST also contain a
  "type" attribute with a value of either "individual" (that identifies
  the name as belonging to an individual) or "role" (that identifies the
  name as belonging to an abstract entity).

  - A <contact:organization> element that contains the name of the
  organization with which the contact is affiliated.  This element is
  OPTIONAL.

  - A <contact:address> element that contains address information
  associated with the contact.  A <contact:address> element SHALL
  contain the following child elements:

    - One or two <contact:street> elements that contain the contact's
    street address.

    - A <contact:city> element that contains the contact's city.

    - A <contact:state-province> element that contains the contact's
    state or province.  This element is OPTIONAL for addressing schemes
    that do not require a state or province name.

    - A <contact:postal-code> element that contains the contact's postal
    code.

    - A <contact:country> element that contains the two-character
    identifier representing with the contact's country.

  - A <contact:voice> element that contains the contact's telephone
  number.

  - A <contact:facsimile> element that contain's the contacts facsimile
  telephone number.  This element is OPTIONAL.

  - A <contact:email> element that contains the contact's e-mail
  address.




Hollenbeck                Expires May 10, 2001                  [Page 7]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  - A <contact:created-by> element that contains the identifier of the
  client that created the contact name.

  - A <contact:created-date> element that contains the date and time of
  contact creation.

  - A <contact:expiration-date> element that contains the date and time
  identifying the end of the contact's registration period.

  - A <contact:last-updated-by> element that contains the identifier of
  the client that last updated the contact name.  This element MUST NOT
  be present if the contact has never been modified.

  - A <contact:last-updated-date> element that contains the date and
  time of the most recent contact modification.  This element MUST NOT
  be present if the contact has never been modified.

  - A <contact:last-transfer-date> element that contains the date and
  time of the most recent successful transfer.  This element MUST NOT be
  provided if the contact has never been transferred.

  - A <contact:auth-id> element derived from either the original
  creation transaction or the most recent successful transfer
  transaction.  This element MUST NOT be provided if the querying client
  is not the current sponsoring client.


























Hollenbeck                Expires May 10, 2001                  [Page 8]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <info> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <response-data>
  S:      <contact:info-data xmlns:contact="urn:iana:xmlns:contact"
  S:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  S:        <contact:id>SH0000</contact:id>
  S:        <contact:client-id>ClientY</contact:client-id>
  S:        <contact:name type="individual">John Doe</contact:name>
  S:        <contact:org>Example Corporation, Inc.</contact:org>
  S:        <contact:address>
  S:          <contact:street>123 Example Dr.</contact:street>
  S:          <contact:street>Suite 100</contact:street>
  S:          <contact:city>Dulles</contact:city>
  S:          <contact:state-province>VA</contact:state-province>
  S:          <contact:postal-code>20166-6503</contact:postal-code>
  S:          <contact:country>US</contact:country>
  S:        </contact:address>
  S:        <contact:voice>+1.7035555555</contact:voice>
  S:        <contact:fax>+1.7035555556</contact:fax>
  S:        <contact:email>jdoe@example.com</contact:email>
  S:        <contact:created-by>ClientX</contact:created-by>
  S:        <contact:created-date>1999-04-03T22:00:00.0Z
  S:        </contact:created-date>
  S:        <contact:last-updated-by>ClientX</contact:last-updated-by>
  S:        <contact:last-updated-date>1999-12-03T09:00:00.0Z
  S:        </contact:last-updated-date>
  S:        <contact:last-transfer-date>2000-04-08T09:00:00.0Z
  S:        </contact:last-transfer-date>
  S:        <contact:auth-id>
  S:          <contact:date>2000-04-08</contact:date>
  S:          <contact:client-id>ClientY</contact:client-id>
  S:          <contact:code>ABC-98765-XYZ</contact:code>
  S:        </contact:auth-id>
  S:      </contact:info-data>
  S:    </response-data>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>



Hollenbeck                Expires May 10, 2001                  [Page 9]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if an <info> command could not
  be processed for any reason.

3.1.2 EPP <ping> Command

  The EPP <ping> command is used to determine if a contact identifier is
  known to the server.  In addition to the standard EPP command
  elements, the <ping> command MUST contain a <contact:ping> element
  that identifies the contact namespace and the location of the contact
  schema.  The <contact:ping> element MUST contain the following child
  elements:

  - One or more (up to a maximum of sixteen) <contact:id> elements that
  contain the server-unique identifier for the queried contacts.

  Example <ping> command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <ping>
  C:      <contact:ping xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:        <contact:id>SH0001</contact:id>
  C:        <contact:id>SH0002</contact:id>
  C:      </contact:ping>
  C:    </ping>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ClientX</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When a <ping> command has been processed successfully, the EPP
  <response-data> element MUST contain a child <contact:ping-data>
  element that identifies the contact namespace and the location of the
  contact schema.  The <contact:ping-data> element SHALL contain the
  following child elements:




Hollenbeck                Expires May 10, 2001                 [Page 10]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  - One or more (up to a maximum of sixteen) <contact:id> elements that
  contain the server-unique identifier for the queried contacts and a
  "result" attribute whose value identifies the object as either "known"
  or "unknown".

  Example <ping> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <response-data>
  S:      <contact:ping-data xmlns:contact="urn:iana:xmlns:contact"
  S:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  S:        <contact:id result="known">SH0000</contact:id>
  S:        <contact:id result="unknown">SH0001</contact:id>
  S:        <contact:id result="known">SH0002</contact:id>
  S:      </contact:ping-data>
  S:    </response-data>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if a <ping> command could not
  be processed for any reason.

3.1.3 EPP <transfer> Command

  The EPP <transfer> command provides a query operation that allows a
  client to determine real-time status of pending and completed transfer
  requests.  In addition to the standard EPP command elements, the
  <transfer> command MUST contain an "op" attribute with value "query",
  and a <contact:transfer-query> element that identifies the contact
  namespace and the location of the contact schema.  The
  <contact:transfer-query> element MUST contain the following child
  elements:

  - A <contact:id> element that contains the server-unique identifier
  for the queried contact.




Hollenbeck                Expires May 10, 2001                 [Page 11]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <transfer> query command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <transfer op="query">
  C:      <contact:transfer-query
  C:       xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:      </contact:transfer-query>
  C:      <auth-id>
  C:        <date>1999-06-08</date>
  C:        <client-id>ClientX</client-id>
  C:        <code>ABC-98765-XYZ</code>
  C:      </auth-id>
  C:    </transfer>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ClientX</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When a <transfer> command has been processed successfully, a server
  MUST respond with an EPP <response-data> element that MUST contain a
  child <contact:transfer-data> element that identifies the contact
  namespace and the location of the contact schema.  The
  <contact:transfer-data> element SHALL contain the following child
  elements:

  - A <contact:id> element that contains the server-unique identifier
  for the queried contact.

  - A <contact:request-client> element that contains the identifier of
  the client that initiated the transfer request.

  - A <contact:action-client> element that contains the identifier of
  the client that SHOULD respond to the transfer request.

  - A <contact:transfer-status> element that contains the state of the
  most recent transfer request.  Valid values are "PENDING", "APPROVED",
  "REJECTED", "AUTO-APPROVED", "AUTO-REJECTED", and "CANCELLED".




Hollenbeck                Expires May 10, 2001                 [Page 12]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  - A <contact:request-date> element that contains the date and time
  that the transfer was requested.

  - A <contact:action-date> element that contains the date and time of a
  required or completed response.  For a PENDING request, the value
  identifies the date and time by which a response is required before an
  automated response action SHALL be taken by the server.  For all other
  status types, the value identifies the date and time when the request
  was completed.

  Example <transfer> query response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <response-data>
  S:      <contact:transfer-data xmlns:contact="urn:iana:xmlns:contact"
  S:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  S:        <contact:id>SH0000</contact:id>
  S:        <contact:request-client>ClientX</contact:request-client>
  S:        <contact:action-client>ClientY</contact:action-client>
  S:        <contact:transfer-status>PENDING</contact:transfer-status>
  S:        <contact:request-date>
  S:          2000-06-06T22:00:00.0Z
  S:        </contact:request-date>
  S:        <contact:action-date>
  S:          2000-06-11T22:00:00.0Z
  S:        </contact:action-date>
  S:      </contact:transfer-data>
  S:    </response-data>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if a <transfer> query command
  could not be processed for any reason.

3.2 EPP Transform Commands




Hollenbeck                Expires May 10, 2001                 [Page 13]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  EPP provides four commands to transform contact object information:
  <create> to create an instance of a contact object, <delete> to delete
  an instance of a contact object, <transfer> to manage contact object
  sponsorship changes, and <update> to change information associated
  with a contact object.  This document does not define a mapping for
  the EPP <renew> command.

3.2.1 EPP <create> Command

  The EPP <create> command provides a transform operation that allows a
  client to create a contact object.  In addition to the standard EPP
  command elements, the <create> command MUST contain a <contact:create>
  element that identifies the contact namespace and the location of the
  contact schema.  The <contact:create> element SHALL contain the
  following child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the contact to be created.

  - A <contact:name> element that contains the name of the individual or
  role represented by the contact.  Each element MUST also contain a
  "type" attribute with a value of either "individual" (that identifies
  the name as belonging to an individual) or "role" (that identifies the
  name as belonging to an abstract entity).

  - A <contact:org> element that contains the name of the organization
  with which the contact is affiliated.  This element is OPTIONAL.

  - A <contact:address> element that contains address information
  associated with the contact.  A <contact:address> element SHALL
  contain the following child elements:

    - One or two <contact:street> elements that contain the contact's
    street address.

    - A <contact:city> element that contains the contact's city.

    - A <contact:state-province> element that contains the contact's
    state or province.  This element is OPTIONAL for addressing schemes
    that do not require a state or province name.

    - A <contact:postal-code> element that contains the contact's postal
    code.

    - A <contact:country> element that contains the two-character
    identifier representing with the contact's country.

  - A <contact:voice> element that contains the contact's telephone



Hollenbeck                Expires May 10, 2001                 [Page 14]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  number.

  - A <contact:fax> element that contains the contact's facsimile
  telephone number.  This element is OPTIONAL.

  - A <contact:email> element that contains the contact's e-mail
  address.

  Example <create> command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <create>
  C:      <contact:create xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:        <contact:name type="individual">John Doe</contact:name>
  C:        <contact:org>Example Corporation, Inc.
  C:        </contact:org>
  C:        <contact:address>
  C:          <contact:street>123 Example Dr.</contact:street>
  C:          <contact:street>Suite 100</contact:street>
  C:          <contact:city>Dulles</contact:city>
  C:          <contact:state-province>VA</contact:state-province>
  C:          <contact:postal-code>20166-6503</contact:postal-code>
  C:          <contact:country>US</contact:country>
  C:        </contact:address>
  C:        <contact:voice>+1.7035555555</contact:voice>
  C:        <contact:fax>+1.7035555556</contact:fax>
  C:        <contact:email>jdoe@example.com</contact:email>
  C:      </contact:create>
  C:    </create>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ExampleCo</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When a <create> command has been processed successfully, a server MUST
  respond with an EPP response with no <response-data> element.






Hollenbeck                Expires May 10, 2001                 [Page 15]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <create> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if a <create> command could not
  be processed for any reason.

3.2.2 EPP <delete> Command

  The EPP <delete> command provides a transform operation that allows a
  client to delete a contact object.  In addition to the standard EPP
  command elements, the <delete> command MUST contain a <contact:delete>
  element that identifies the contact namespace and the location of the
  contact schema.  The <contact:delete> element MUST contain the
  following child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the contact to be deleted.

  A contact MUST NOT be deleted if it is associated with other known
  objects.  Such a contact MUST NOT be deleted until the association
  with other known objects has been broken.














Hollenbeck                Expires May 10, 2001                 [Page 16]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <delete> command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <delete>
  C:      <contact:delete xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:      </contact:delete>
  C:    </delete>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ClientX</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When a <delete> command has been processed successfully, a server MUST
  respond with an EPP response with no <response-data> element.

  Example <delete> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if a <delete> command could not
  be processed for any reason.

3.2.3 EPP <renew> Command




Hollenbeck                Expires May 10, 2001                 [Page 17]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  Renewal semantics do not apply to contact objects, so there is no
  mapping defined for the EPP <renew> command.

3.2.4 EPP <transfer> Command

  The EPP <transfer> command provides a transform operation that allows
  a client to manage requests to transfer the sponsorship of a contact
  object.  In addition to the standard EPP command elements, the
  <transfer> command MUST contain a <contact:transfer> element that
  identifies the contact namespace and the location of the contact
  schema. The <contact:transfer> element MUST contain the following
  child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the contact for which a transfer request is to be created,
  approved, rejected, or cancelled.

  Every EPP <transfer> command MUST contain an "op" attribute that
  identifies the transfer operation to be performed.  Valid values,
  definitions, and authorizations for all attribute values are defined
  in [EPP].

  Every EPP <transfer> command MUST also contain an authorization
  identifier as described in [EPP].  It is important to note that the
  transaction identifier associated with successful transfer of a
  contact object becomes the authorization identifier required to
  authorize subsequent transfers of sponsorship of the contact object.
  A client MUST retain all transaction identifiers associated with
  successful contact object transfers and protect them from disclosure.
  A client MUST provide a copy of the transaction identifier information
  to the contact registrant, who will need this information to request a
  contact transfer through a different client.



















Hollenbeck                Expires May 10, 2001                 [Page 18]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <transfer> request command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <transfer op="request">
  C:      <contact:transfer xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:      </contact:transfer>
  C:      <auth-id>
  C:        <date>1999-06-08</date>
  C:        <client-id>ClientY</client-id>
  C:        <code>ABC-98765-XYZ</code>
  C:      </auth-id>
  C:    </transfer>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ClientX</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When a <transfer> command has been processed successfully, a server
  MUST respond with an EPP <response-data> element that MUST contain a
  child <contact:transfer-data> element that identifies the contact
  namespace and the location of the contact schema.  The
  <contact:transfer-data> element SHALL contain the same child elements
  defined for a transfer query response.


















Hollenbeck                Expires May 10, 2001                 [Page 19]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <transfer> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <response-data>
  S:      <contact:transfer-data xmlns:contact="urn:iana:xmlns:contact"
  S:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  S:        <contact:id>SH0000</contact:id>
  S:        <contact:request-client>ClientX</contact:request-client>
  S:        <contact:action-client>ClientY</contact:action-client>
  S:        <contact:transfer-status>PENDING</contact:transfer-status>
  S:        <contact:request-date>
  S:          2000-06-08T22:00:00.0Z
  S:        </contact:request-date>
  S:        <contact:action-date>
  S:          2000-06-13T22:00:00.0Z
  S:        </contact:action-date>
  S:      </contact:transfer-data>
  S:    </response-data>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if a <transfer> command could
  not be processed for any reason.

3.2.5 EPP <update> Command

  The EPP <update> command provides a transform operation that allows a
  client to modify the attributes of a contact object.  In addition to
  the standard EPP command elements, the <update> command MUST contain a
  <contact:update> element that identifies the contact namespace and the
  location of the contact schema. The <contact:update> element SHALL
  contain the following child elements:

  - A <contact:id> element that contains the server-unique identifier
  for the contact to be updated.



Hollenbeck                Expires May 10, 2001                 [Page 20]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  The <contact:update> element SHALL contain at least one of the
  following child elements:

  - A <contact:change> element that contains content object attribute
  values to be added or changed.  A <contact:change> element SHALL
  contain at least one of the following child elements:

    - A <contact:name> element that contains the name of the individual
    or role represented by the contact.  Each element MUST also contain
    a "type" attribute with a value of either "individual" (that
    identifies the name as belonging to an individual) or "role" (that
    identifies the name as belonging to an abstract entity).

    - A <contact:org> element that contains the name of the organization
    with which the contact is affiliated.  This element is OPTIONAL.

    - A <contact:address> element that contains address information
    associated with the contact.  A <contact:address> element SHALL
    contain the following child elements:

      - One or two <contact:street> elements that contain the contact's
      street address.

      - A <contact:city> element that contains the contact's city.

      - A <contact:state-province> element that identifies the contact's
      state, province, or other local identifier.  This element is
      OPTIONAL for addressing schemes that do not require a state or
      province name.

      - A <contact:postal-code> element that contains the contact's
      postal code.

      - A <contact:country> element that contains the two-character
      identifier representing with the contact's country.

    - A <contact:voice> element that contains the contact's telephone
    number.

    - A <contact:fax> element that contain's the contacts facsimile
    telephone number.  This element is OPTIONAL.

    - A <contact:email> element that contains the contact's e-mail
    address.

  - A <contact:remove> element that identifies OPTIONAL elements to be
  removed from the content object.  A <contact:remove> element SHALL
  contain at least one of the following child elements:



Hollenbeck                Expires May 10, 2001                 [Page 21]

Internet-Draft            EPP Contact Mapping          November 10, 2000


    - A <contact:org> element that contains the name of the organization
    to be removed.

    - A <contact:fax> element that contain's the facsimile telephone
    number to be removed.

  Example <update> command:

  C:<?xml version="1.0" standalone="no"?>
  C:<epp xmlns="urn:iana:xmlns:epp"
  C:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  C:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  C:  <command>
  C:    <update>
  C:      <contact:update xmlns:contact="urn:iana:xmlns:contact"
  C:       xsi:schemaLocation="urn:iana:xmlns:contact contact.xsd">
  C:        <contact:id>SH0000</contact:id>
  C:        <contact:change>
  C:          <contact:name type="individual">John Doe</contact:name>
  C:          <contact:org>Example Corporation, Inc.</contact:org>
  C:          <contact:address>
  C:            <contact:street>124 Example Dr.</contact:street>
  C:            <contact:street>Suite 200</contact:street>
  C:            <contact:city>Dulles</contact:city>
  C:            <contact:state-province>VA</contact:state-province>
  C:            <contact:postal-code>20166-6503</contact:postal-code>
  C:            <contact:country>US</contact:country>
  C:          </contact:address>
  C:          <contact:voice>+1.7034444444</contact:voice>
  C:          <contact:email>jdoe@example.com</contact:email>
  C:        </contact:change>
  C:        <contact:remove>
  C:          <contact:fax>+1.7035555556</contact:fax>
  C:        </contact:remove>
  C:      </contact:update>
  C:    </update>
  C:    <trans-id>
  C:      <date>2000-06-08</date>
  C:      <client-id>ExampleCo</client-id>
  C:      <code>ABC-12345-XYZ</code>
  C:    </trans-id>
  C:  </command>
  C:</epp>

  When an <update> command has been processed successfully, a server
  MUST respond with an EPP response with no <response-data> element.





Hollenbeck                Expires May 10, 2001                 [Page 22]

Internet-Draft            EPP Contact Mapping          November 10, 2000



  Example <update> response:

  S:<?xml version="1.0" standalone="no"?>
  S:<epp xmlns="urn:iana:xmlns:epp"
  S:     xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
  S:     xsi:schemaLocation="urn:iana:xmlns:epp epp.xsd">
  S:  <response>
  S:    <result code="1000">
  S:      <text>Command completed successfully</text>
  S:    </result>
  S:    <trans-id>
  S:      <date>2000-06-08</date>
  S:      <client-id>ClientX</client-id>
  S:      <code>ABC-12345-XYZ</code>
  S:    </trans-id>
  S:  </response>
  S:</epp>

  An EPP error response MUST be returned if an <update> command could
  not be processed for any reason.

4. Formal Syntax

  An EPP object mapping is specified in XML Schema notation.  The formal
  syntax presented here is a complete schema representation of the
  object mapping suitable for automated validation of EPP XML instances.

  <?xml version="1.0"?>

  <schema xmlns="http://www.w3.org/1999/XMLSchema"
          xmlns:contact="urn:iana:xmlns:contact"
          targetNamespace="urn:iana:xmlns:contact"
          elementFormDefault="qualified">

    <annotation>
      <documentation>
        Extensible Provisioning Protocol v1.0
        contact provisioning schema.
      </documentation>
    </annotation>

  <!--
  Various common, simple type definitions.
  -->
    <simpleType name="idType" base="string">
      <minLength value="4"/>
      <maxLength value="16"/>



Hollenbeck                Expires May 10, 2001                 [Page 23]

Internet-Draft            EPP Contact Mapping          November 10, 2000


    </simpleType>

    <simpleType name="orgType" base="string">
      <minLength value="4"/>
      <maxLength value="128"/>
    </simpleType>

    <simpleType name="localeType" base="string">
      <minLength value="1"/>
      <maxLength value="64"/>
    </simpleType>

    <simpleType name="postalCodeType" base="string">
      <minLength value="1"/>
      <maxLength value="16"/>
    </simpleType>

    <simpleType name="countryType" base="string">
      <length value="2"/>
    </simpleType>

    <simpleType name="e164Type" base="string">
      <pattern value="+[0-9]{1,3}.[0-9]{1,12}"/>
     </simpleType>

    <simpleType name="contactType" base="string">
      <enumeration value="individual"/>
      <enumeration value="role"/>
    </simpleType>

    <complexType name="nameType" content="textOnly">
      <minLength value="4"/>
      <maxLength value="128"/>
      <attribute name="type" use="required" type="contact:contactType"/>
    </complexType>

    <simpleType name="clientIDType" base="string">
      <minLength value="3"/>
      <maxLength value="16"/>
      <pattern value="[A-Za-z0-9]{3,16}"/>
    </simpleType>

    <simpleType name="codeType" base="string">
      <minLength value="8"/>
      <maxLength value="16"/>
      <pattern value="[A-Za-z0-9][A-Za-z0-9-]{6,14}[A-Za-z0-9]"/>
    </simpleType>
    <complexType name="xidType" content="elementOnly">



Hollenbeck                Expires May 10, 2001                 [Page 24]

Internet-Draft            EPP Contact Mapping          November 10, 2000


      <element name="date" type="date"/>
      <element name="client-id" type="contact:clientIDType"/>
      <element name="code" type="contact:codeType"/>
    </complexType>

  <!--
  Types used within an EPP greeting.
  -->
    <complexType name="emptyType" content="empty"/>
    <element name="service" type="contact:emptyType"/>

  <!--
  Child elements found in EPP commands.
  -->
    <element name="create" type="contact:createType"/>
    <element name="delete" type="contact:idOnlyType"/>
    <element name="info" type="contact:idOnlyType"/>
    <element name="ping" type="contact:multiIDType"/>
    <element name="transfer" type="contact:idOnlyType"/>
    <element name="transfer-query" type="contact:idOnlyType"/>
    <element name="update" type="contact:updateType"/>

  <!--
  Child elements of the <create> and <info> commands.
  -->
    <complexType name="createType" content="elementOnly">
      <element name="id" type="contact:idType"/>
      <element name="name" type="contact:nameType"/>
      <element name="org" type="contact:orgType"
       minOccurs="0" maxOccurs="1"/>
      <element name="address" type="contact:addressType"/>
      <element name="voice" type="contact:e164Type"/>
      <element name="fax" type="contact:e164Type"
       minOccurs="0" maxOccurs="1"/>
      <element name="email" type="string"/>
    </complexType>

    <complexType name="addressType" content="elementOnly">
      <element name="street" type="contact:localeType"
       minOccurs="1" maxOccurs="2"/>
      <element name="city" type="contact:localeType"/>
      <element name="state-province" type="contact:localeType"
       minOccurs="0" maxOccurs="1"/>
      <element name="postal-code" type="contact:postalCodeType"/>
      <element name="country" type="contact:countryType"/>
    </complexType>

  <!--



Hollenbeck                Expires May 10, 2001                 [Page 25]

Internet-Draft            EPP Contact Mapping          November 10, 2000


  Child element of commands that require only an identifier.
  -->
    <complexType name="idOnlyType" content="elementOnly">
      <element name="id" type="contact:idType"/>
    </complexType>

  <!--
  Child element of commands that accept multiple identifiers.
  -->
    <complexType name="multiIDType" content="elementOnly">
      <element name="id" type="contact:idType"
       minOccurs="1" maxOccurs="16"/>
    </complexType>

  <!--
  Child elements of the <update> command.
  -->
    <complexType name="updateType" content="elementOnly">
      <element name="id" type="contact:idType"/>
      <element name="change" type="contact:changeType"/>
      <element name="remove" type="contact:removeType"/>
    </complexType>

  <!--
  Attribute elements that can be changed.
  -->
    <complexType name="changeType" content="elementOnly">
      <element name="name" type="contact:nameType"
       minOccurs="0" maxOccurs="1"/>
      <element name="org" type="contact:orgType"
       minOccurs="0" maxOccurs="1"/>
      <element name="address" type="contact:addressType"
       minOccurs="0" maxOccurs="1"/>
      <element name="voice" type="contact:e164Type"
       minOccurs="0" maxOccurs="1"/>
      <element name="fax" type="contact:e164Type"
       minOccurs="0" maxOccurs="1"/>
      <element name="email" type="string"
       minOccurs="0" maxOccurs="1"/>
    </complexType>

  <!--
  Attribute elements that can be removed.
  -->
    <complexType name="removeType" content="elementOnly">
      <element name="org" type="contact:orgType"
       minOccurs="0" maxOccurs="1"/>
      <element name="fax" type="contact:e164Type"



Hollenbeck                Expires May 10, 2001                 [Page 26]

Internet-Draft            EPP Contact Mapping          November 10, 2000


       minOccurs="0" maxOccurs="1"/>
    </complexType>

  <!--
  Child response elements.
  -->
    <element name="info-data" type="contact:infoDataType"/>
    <element name="ping-data" type="contact:pingDataType"/>
    <element name="transfer-data" type="contact:transferDataType"/>

  <!--
  Info response elements.
  -->
    <complexType name="infoDataType" content="elementOnly">
      <element name="id" type="contact:idType"/>
      <element name="client-id" type="contact:clientIDType"/>
      <element name="name" type="contact:nameType"/>
      <element name="org" type="contact:orgType"
       minOccurs="0" maxOccurs="1"/>
      <element name="address" type="contact:addressType"/>
      <element name="voice" type="contact:e164Type"/>
      <element name="fax" type="contact:e164Type"
       minOccurs="0" maxOccurs="1"/>
      <element name="email" type="string"/>
      <element name="created-by" type="contact:clientIDType"/>
      <element name="created-date" type="timeInstant"/>
      <element name="last-updated-by" type="contact:clientIDType"
       minOccurs="0" maxOccurs="1"/>
      <element name="last-updated-date" type="timeInstant"
       minOccurs="0" maxOccurs="1"/>
      <element name="last-transfer-date" type="timeInstant"
       minOccurs="0" maxOccurs="1"/>
      <element name="auth-id" type="contact:xidType"
        minOccurs="0" maxOccurs="1"/>
    </complexType>

  <!--
  Ping response elements.
  -->
    <simpleType name="pingResultType" base="string">
      <enumeration value="known"/>
      <enumeration value="unknown"/>
    </simpleType>
    <complexType name="pingIDType" content="textOnly">
      <minLength value="4"/>
      <maxLength value="16"/>
      <attribute name="result" use="required"
       type="contact:pingResultType"/>



Hollenbeck                Expires May 10, 2001                 [Page 27]

Internet-Draft            EPP Contact Mapping          November 10, 2000


    </complexType>
    <complexType name="pingDataType" content="elementOnly">
      <element name="id" type="contact:pingIDType"
       minOccurs="1" maxOccurs="16"/>
    </complexType>

  <!--
  Transfer response elements.
  -->
    <complexType name="transferDataType" content="elementOnly">
      <element name="id" type="contact:idType"/>
      <element name="request-client" type="contact:clientIDType"/>
      <element name="action-client" type="contact:clientIDType"/>
      <element name="transfer-status" type="contact:transferStatusType"/>
      <element name="request-date" type="timeInstant"/>
      <element name="action-date" type="timeInstant"/>
    </complexType>
    <simpleType name="transferStatusType" base="string">
      <enumeration value="PENDING"/>
      <enumeration value="APPROVED"/>
      <enumeration value="CANCELLED"/>
      <enumeration value="REJECTED"/>
      <enumeration value="AUTO-APPROVED"/>
      <enumeration value="AUTO-CANCELLED"/>
    </simpleType>

  <!--
  End of schema.
  -->
  </schema>





















Hollenbeck                Expires May 10, 2001                 [Page 28]

Internet-Draft            EPP Contact Mapping          November 10, 2000


5. Internationalization Considerations

  EPP is represented in XML, which provides native support for encoding
  information using the double-byte Unicode character set and its more
  compact representations including UTF-8.  Compliant XML processors are
  required to understand both UTF-8 and raw Unicode character sets; XML
  also includes a provision for identifying other character sets through
  use of an "encoding" attribute in an <?xml?> processing instruction.
  The complete list of character set encoding identifiers is maintained
  by IANA and is described in [CHARSET] and [RFC1700].

  All date-time values presented via EPP MUST be expressed in Universal
  Coordinated Time.  The XML Schema "date" format allows use of time
  zone identifiers to indicate offsets from the zero meridian, but this
  option MUST NOT be used within EPP.  Both extended and truncated date
  and time forms defined in [ISO8601] MAY be used.

6. IANA Considerations

  XML schemas require a URI for unique identification.  Schemas MUST be
  registered to ensure URI uniqueness, but the IETF does not currently
  have a recommended repository for the registration of XML schemas.
  This document uses URNs to describe XML namespaces and XML schemas.
  IANA SHOULD maintain a registry of XML namespace and schema URI
  assignments.  Per policies described in [IANA], URI assignment
  requests SHOULD be reviewed by a designated expert, and values SHOULD
  be assigned only as a result of standards action taken by the IESG.

7. Security Considerations

  The object mapping described in this document does not provide any
  security services beyond those specified by [EPP].



















Hollenbeck                Expires May 10, 2001                 [Page 29]

Internet-Draft            EPP Contact Mapping          November 10, 2000


8. References

  [CHARSET] ftp://ftp.isi.edu/in-notes/iana/assignments/character-sets

  [E164a] ITU-T Recommendation E.164: "The International Public
  Telecommunication Numbering Plan", May 1997.

  [E164b] Complement To ITU-T Recommendation E.164 (05/1997):  "List of
  ITU-T Recommendation E.164 assigned country codes", June 2000.

  [EPP] S. Hollenbeck: "Extensible Provisioning Protocol", draft-
  hollenbeck-epp-00.txt, work in progress.

  [IANA] T. Narten, H. Alvestrand: "Guidelines for Writing an IANA
  Considerations Section in RFCs", BCP 26, RFC 2434, October 1998.

  [ISO3166] ISO 3166-1: "Codes for the representation of names of
  countries and their subdivisions - Part 1: Country codes", October
  1997.

  [ISO8601] ISO 8601:1988 (E): "Data elements and interchange formats -
  Information interchange - Representation of dates and times - The
  International Organization for Standardization".

  [RFC822] D. Crocker: "Standard for the Format Of ARPA Internet Text
  Messages", RFC 822, August 1982.

  [RFC1700] J. Reynolds, J. Postel: "Assigned Numbers", STD 2, RFC 1700,
  October 1994.

  [RFC2119] S. Bradner: "Key Words for Use in RFCs to Indicate
  Requirement Levels", BCP 14, RFC 2119, March 1997.

  [XML] Editor T. Bray et al.: "Extensible Markup Language (XML) 1.0",
  http://www.w3.org/TR/REC-xml, W3C Recommendation February 1998

  [XML-SD] Editors P. Biron and A. Malhotra: "XML Schema Part 2:
  Datatypes", http://www.w3.org/TR/xmlschema-2/, W3C Working Draft April
  2000

  [XML-SS] Editor H. Thompson et al.: "XML Schema Part 1: Structures",
  http://www.w3.org/TR/xmlschema-1/, W3C Working Draft April 2000









Hollenbeck                Expires May 10, 2001                 [Page 30]

Internet-Draft            EPP Contact Mapping          November 10, 2000


9. Author's Address

  Scott Hollenbeck
  VeriSign Global Registry Services
  21345 Ridgetop Circle
  Dulles, VA 20166-6503
  USA
  shollenbeck@verisign.com











































Hollenbeck                Expires May 10, 2001                 [Page 31]

Internet-Draft            EPP Contact Mapping          November 10, 2000


10. Full Copyright Statement

  Copyright (C) The Internet Society 2000.  All Rights Reserved.

  This document and translations of it may be copied and furnished to
  others, and derivative works that comment on or otherwise explain it
  or assist in its implementation may be prepared, copied, published and
  distributed, in whole or in part, without restriction of any kind,
  provided that the above copyright notice and this paragraph are
  included on all such copies and derivative works.  However, this
  document itself may not be modified in any way, such as by removing
  the copyright notice or references to the Internet Society or other
  Internet organizations, except as needed for the purpose of developing
  Internet standards in which case the procedures for copyrights defined
  in the Internet Standards process must be followed, or as required to
  translate it into languages other than English.

  The limited permissions granted above are perpetual and will not be
  revoked by the Internet Society or its successors or assigns.

  This document and the information contained herein is provided on an
  "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
  TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT
  NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN
  WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
  MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

Acknowledgement

  Funding for the RFC Editor function is currently provided by the
  Internet Society.




















Hollenbeck                Expires May 10, 2001                 [Page 32]
